<template>
  <div>
    <tiny-chart-line :data="chartData" :settings="chartSettings"></tiny-chart-line>
  </div>
</template>

<script setup lang="jsx">
import { ref } from 'vue'
import { ChartLine as TinyChartLine } from '@opentiny/vue'

const chartData = ref({
  columns: ['日期', '访问用户', '下单用户', '下单率'],
  rows: [
    { 日期: '1/1', 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
    { 日期: '1/2', 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
    { 日期: '1/3', 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
    { 日期: '1/4', 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
    { 日期: '1/5', 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
    { 日期: '1/6', 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 },
    { 日期: '1/7', 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
    { 日期: '1/8', 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
    { 日期: '1/9', 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
    { 日期: '1/10', 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
    { 日期: '1/11', 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
    { 日期: '1/12', 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 }
  ]
})
// 设置显示的指标维度
const chartSettings = ref({
  // 'xAxis.0.axisLabel.rotate': 45
})
</script>
