[
  {
    "title": "Column Header Prompt",
    "content": "<p>There are two types of column header prompts. One is <code>show-header-tip</code> prompt (a prompt is displayed regardless of whether the content exceeds the value of <code>show-header-overflow</code>). The other is hidden and prompt when the content exceeds the current line. The options of </p>\n<div class=\"tip custom-block\"><p class=\"custom-block-title\">TIP</p>\n<p><code>show-header-overflow</code> are as follows: </p>\n<ul>\n<li><code>tooltip</code>: displays the content that exceeds the value of <code>...</code>, displays all information at the prompt layer on the left or right, and displays the default prompt when <code>show-overflow</code> is enabled. </li>\n<li><code>title</code>: Same as the <code>title</code> attribute of the native tag. </li>\n<li><code>ellipsis</code>: <code>...</code> is displayed for the extra content, and </li>\n</ul>\n</div>\n is not displayed",
    "link": "grid/tip/column-header-tip",
    "component": "Grid Table",
    "findIntroStr": "Table component, which provides powerful data table functions. In Grid, data lists can be displayed, selected, and edited.",
    "demoId": "tip-column-header-tip"
  },
  {
    "title": "Cell Prompt",
    "content": "<p> There are two types of cell prompts. One is the <code>show-tip</code> prompt (a prompt is displayed regardless of whether the content exceeds the current line). The other is the <code>show-overflow</code> prompt is hidden and displayed when the content exceeds the current line. The options of </p>\n<div class=\"tip custom-block\"><p class=\"custom-block-title\">TIP</p>\n<p><code>show-overflow</code> are as follows: </p>\n<ul>\n<li><code>title</code>: consistent with the <code>title</code> attribute of the native tag </li>\n<li><code>ellipsis</code>: <code>...</code> is displayed for the extra content. </li>\n<li><code>tooltip</code>: <code>...</code> is displayed for the extra content. The left/right pop-up prompt layer displays all information. The default prompt when <code>show-overflow</code> is enabled\n<code>tooltip</code> can be prompted through the <code>Grid</code> property <code>: Configure tooltip-config</code>. For details about the configuration method, see </li>\n</ul>\n</div>\n of the Tooltip</code> component",
    "link": "grid/tip/cell-tip",
    "component": "Grid Table",
    "findIntroStr": "Table component, which provides powerful data table functions. In Grid, data lists can be displayed, selected, and edited.",
    "demoId": "tip-cell-tip"
  }
]